----------------------------- MODULE HourClock ------------------------------
(* 引入自然数的运算符 比如加减乘除 这些并没有内置在TLA+中 *)
EXTENDS Naturals
VARIABLE hr

HCInit == hr \in (1..12)
HCNext == hr' = IF hr # 12 THEN hr + 1 ELSE 1  \* #是不等于的意思
(* 或者也可以用% 取模来实现这个功能 *)
(* HCNext == hr' = hr % 12 + 1 *)

(* 如果时钟需要和别的系统关联，比如当前小时内气温的变化 *)
(* 那么有可能气温变化，但是小时未变化 *)
(* 所以不仅需要HCNext还需要暂停 即HCNext \/ (hr' = hr) 在TLA中可以表示为 [HCNext]_hr *)
HCSpec == HCInit /\ [] [HCNext]_hr   \* [] box 表示某个命题永远正确

------------------------------------------------------------------------
THEOREM HCSpec => [] HCInit
========================================================================

